Revit 2015 API
EnergyAnalysisOpening.OriginatingElementId Property
 The element id for the originating Revit element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This property is obsolete in 2015. Use CADObjectUniqueId and CADLinkUniqueId instead.")]
public LinkElementId OriginatingElementId { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in 2015. Use CADObjectUniqueId and CADLinkUniqueId instead.")> _
Public ReadOnly Property OriginatingElementId As LinkElementId
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in 2015. Use CADObjectUniqueId and CADLinkUniqueId instead.")]
public:
property LinkElementId^ OriginatingElementId {
	LinkElementId^ get ();
}
See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace